## Data Manipulation

In [24]:
import pandas as pd

In [25]:
data = {'Product': ['TV', 'Fridge', 'Washing Machine', 'Wooden Items'],
        'Price': [8000, 18000, 23000, 40000],
        'Units_Sold': [50, 150, 300, 200]}

In [26]:
df=pd.DataFrame(data)

In [27]:
df

           Product  Price  Units_Sold
0               TV   8000          50
1           Fridge  18000         150
2  Washing Machine  23000         300
3     Wooden Items  40000         200

In [28]:
df=df.assign(Total_Revenue=df["Price"]*df["Units_Sold"])
df

           Product  Price  Units_Sold  Total_Revenue
0               TV   8000          50         400000
1           Fridge  18000         150        2700000
2  Washing Machine  23000         300        6900000
3     Wooden Items  40000         200        8000000

In [29]:
df=df.drop(columns=["Units_Sold"])

In [30]:
df

           Product  Price  Total_Revenue
0               TV   8000         400000
1           Fridge  18000        2700000
2  Washing Machine  23000        6900000
3     Wooden Items  40000        8000000

In [31]:
df=df.rename(columns={"price":"unit_price","Total_Revenue":"Revenue"})
df

           Product  Price  Revenue
0               TV   8000   400000
1           Fridge  18000  2700000
2  Washing Machine  23000  6900000
3     Wooden Items  40000  8000000

In [32]:
df=df.rename(index={0:"A",1:"B",2:"C",3:"D"})
df

           Product  Price  Revenue
A               TV   8000   400000
B           Fridge  18000  2700000
C  Washing Machine  23000  6900000
D     Wooden Items  40000  8000000

In [35]:
df=df.sort_values(by="Revenue",ascending=True)
df

           Product  Price  Revenue
A               TV   8000   400000
B           Fridge  18000  2700000
C  Washing Machine  23000  6900000
D     Wooden Items  40000  8000000

In [36]:
df=df.sort_index()

In [37]:
df

           Product  Price  Revenue
A               TV   8000   400000
B           Fridge  18000  2700000
C  Washing Machine  23000  6900000
D     Wooden Items  40000  8000000

In [41]:
filtered_data=df[df["Revenue"]>500000]
filtered_data

           Product  Price  Revenue
B           Fridge  18000  2700000
C  Washing Machine  23000  6900000
D     Wooden Items  40000  8000000

In [43]:
filtered_data2=df[(df["Price"]<20000) & (df["Revenue"]>500000)]
filtered_data2

  Product  Price  Revenue
B  Fridge  18000  2700000